app/mailers/agenda_mailer.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def agenda_mail(agenda)
    @agenda = agenda
    @agenda.team.users.each do |user|