app/mailers/team_mailer.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def team_mail(team)
    @team = team
    @user = User.find(@team.owner_id)