app/controllers/agendas_controller.rb

SELECT "teams".* FROM "teams" INNER JOIN "assigns" ON "teams"."id" = "assigns"."team_id" WHERE "assigns"."user_id" = $1  [["user_id", 11]]
INSERT INTO "agendas" ("title", "created_at", "updated_at", "team_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ss"], ["created_at", "2020-12-02 03:30:00.192557"], ["updated_at", "2020-12-02 03:30:00.192557"], ["team_id", 1], ["user_id", 11]]
UPDATE "users" SET "keep_team_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["keep_team_id", 1], ["updated_at", "2020-12-02 03:30:00.191137"], ["id", 11]]
---
  def create
    @agenda = current_user.agendas.build(title: params[:title])
    @agenda.team = Team.friendly.find(params[:team_id])
    current_user.keep_team_id = @agenda.team.id
    if current_user.save && @agenda.save

DELETE FROM "agendas" WHERE "agendas"."id" = $1  [["id", 16]]
---
  def destroy
    if @agenda.user == current_user || current_user.id == @agenda.team.owner_id
        @agenda.destroy

SELECT  "agendas".* FROM "agendas" WHERE "agendas"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def set_agenda
    @agenda = Agenda.find(params[:id])