app/controllers/assigns_controller.rb

  def create
    team = find_team(params[:team_id])
    user = email_reliable?(assign_params) ? User.find_or_create_by_email(assign_params) : nil
---
INSERT INTO "assigns" ("user_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 11], ["team_id", 4], ["created_at", "2020-12-09 17:02:04.525719"], ["updated_at", "2020-12-09 17:02:04.525719"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "111@111.com"], ["LIMIT", 1]]

  def destroy
    assign = Assign.find(params[:id])
---
SELECT  "assigns".* FROM "assigns" WHERE "assigns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def assign_destroy(assign, assigned_user)
    @team = find_team(params[:team_id])
    if current_user.id == @team.owner_id || current_user.id == assign.user_id
      if assigned_user == assign.team.owner
        I18n.t('views.messages.cannot_delete_the_leader')
      elsif Assign.where(user_id: assigned_user.id).count == 1
        I18n.t('views.messages.cannot_delete_only_a_member')
      elsif assign.destroy
---
SELECT COUNT(*) FROM "assigns" WHERE "assigns"."user_id" = $1  [["user_id", 11]]
DELETE FROM "assigns" WHERE "assigns"."id" = $1  [["id", 11]]

  def user_exist?
    team = find_team(params[:team_id])
    unless User.exists?(email: params[:email])
---
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "444@444.com"], ["LIMIT", 1]]

  def set_next_team(assign, assigned_user)
    another_team = Assign.find_by(user_id: assigned_user.id).team
---
SELECT "teams".* FROM "teams" INNER JOIN "assigns" ON "teams"."id" = "assigns"."team_id" WHERE "assigns"."user_id" = $1  [["user_id", 12]]
SELECT  "assigns".* FROM "assigns" WHERE "assigns"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]

  def find_team(team_id)
    team = Team.friendly.find(params[:team_id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]