app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params)
    @team.owner = current_user
    if @team.save
---
INSERT INTO "teams" ("name", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "222"], ["owner_id", 12], ["created_at", "2020-12-09 17:01:53.657447"], ["updated_at", "2020-12-09 17:01:53.657447"]]

  def update
    if @team.update(team_params)
      redirect_to @team, notice: I18n.t('views.messages.update_team')
---
UPDATE "teams" SET "owner_id" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["owner_id", 11], ["updated_at", "2020-12-02 03:48:59.095216"], ["id", 1]]
UPDATE "teams" SET "name" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["name", "3333"], ["updated_at", "2020-12-12 11:16:18.717625"], ["id", 5]]

  def dashboard
    @team = current_user.keep_team_id ? Team.find(current_user.keep_team_id) : current_user.teams.first
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def owner_change
    @assign = Assign.find(params[:assign_user_id])
    @team = Team.find(params[:id])
    @team.update(owner_id: @assign.user.id)
---
SELECT  "assigns".* FROM "assigns" WHERE "assigns"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "teams" SET "owner_id" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["owner_id", 1], ["updated_at", "2020-12-09 16:45:45.886225"], ["id", 1]]

  def set_team
    @team = Team.friendly.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]